DELIMITER || 
CREATE PROCEDURE GET_WORK_DIARY(date_start DATE, date_end DATE, lib VARCHAR(80), loc VARCHAR(20))
BEGIN

    CREATE TEMPORARY TABLE temp_all_statistics 
        SELECT * FROM work_diary_statistics 
        WHERE (homebranch COLLATE utf8mb4_unicode_ci = lib or lib COLLATE utf8mb4_unicode_ci = "")
            AND (location COLLATE utf8mb4_unicode_ci = loc or loc COLLATE utf8mb4_unicode_ci = "");

    ALTER TABLE temp_all_statistics DROP COLUMN homebranch;
    ALTER TABLE temp_all_statistics DROP COLUMN location;
    INSERT INTO temp_all_statistics VALUES 
    (DATE("1970-01-01"), "", "", 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0);

    SELECT 
        "Становило на початку",
        "" as `Підрозділ`,
        "" as `Розташування`,
        SUM(s.`За реєстраційною картотекою`) `За реєстраційною картотекою`,
        SUM(s.`Число відвідувачів`) `Число відвідувачів`,
        -- Вік
        SUM(s.`До 7 років`) as `До 7 років`,
        SUM(s.`Від 7 до 14 років`) as `Від 7 до 14 років`,
        SUM(s.`Від 15 до 17 років`) as `Від 15 до 17 років`,
        SUM(s.`Від 18 до 21 року`) `Від 18 до 21 року`,
        SUM(s.`Від 22 до 59 років`) `Від 22 до 59 років`,
        SUM(s.`Від 60 років`) `Від 60 років`,
        -- Типи 
        SUM(s.`Студенти`) `Студенти`,
        SUM(s.`Люди з особливими потребами`) `Люди з особливими потребами`,
        SUM(s.`Безробітні`) `Безробітні`,
        SUM(s.`Внутрішньо-переміщені особи`) `Внутрішньо-переміщені особи`,
        SUM(s.`Жінки`) `Жінки`,
        -- Книги
        SUM(s.`Всього видано`) `Всього видано`,
        SUM(s.`Книги`) `Книги`,
        SUM(s.`Брошури`) `Брошури`,
        SUM(s.`Періодичні видання`) `Періодичні видання`,
        SUM(s.`Електронні видання`) `Електронні видання`,
        SUM(s.`Аудіовізуальні`) `Аудіовізуальні`,
        -- UDC
        SUM(s.`Суспільно-політична література`) `Суспільно-політична література`,
        SUM(s.`Пр-тво, математика, медицина`) `Пр-тво, математика, медицина`,
        SUM(s.`Техніка`) `Техніка`,
        SUM(s.`С/Г`) `С/Г`,
        SUM(s.`Мистецтво і спорт`) `Мистецтво і спорт`,
        SUM(s.`Художня література`) `Художня література`,
        SUM(s.`Л-ра для дошкільнят, казки`) `Л-ра для дошкільнят, казки`,
        SUM(s.`Мовознавство, літ-тво`) `Мовознавство, літ-тво`,
        SUM(s.`Інші`) `Інші`,
        -- Мови
        SUM(s.`Українською`) `Українською`,
        SUM(s.`Російською`) `Російською`,
        SUM(s.`Англійською`) `Англійською`,
        SUM(s.`Угорською`) `Угорською`,
        SUM(s.`Румунською`) `Румунською`,
        SUM(s.`Словацькою`) `Словацькою`,
        SUM(s.`Іноземною`) `Іноземною`,
        SUM(s.`Без мови`) `Без мови`,
        SUM(s.`Всього повернуто`) `Всього повернуто`
    FROM 
        temp_all_statistics as s
    WHERE 
        CAST(`Дата` as DATE) < date_start
    
    UNION ALL

    SELECT * FROM temp_all_statistics
    WHERE CAST(`Дата` as DATE) BETWEEN date_start AND date_end

    UNION ALL

    SELECT 
        "Всього протягом часу",
        "",
        "",
        SUM(s.`За реєстраційною картотекою`),
        SUM(s.`Число відвідувачів`),
        -- Вік
        SUM(s.`До 7 років`),
        SUM(s.`Від 7 до 14 років`),
        SUM(s.`Від 15 до 17 років`),
        SUM(s.`Від 18 до 21 року`),
        SUM(s.`Від 22 до 59 років`),
        SUM(s.`Від 60 років`),
        -- Типи 
        SUM(s.`Студенти`),
        SUM(s.`Люди з особливими потребами`),
        SUM(s.`Безробітні`),
        SUM(s.`Внутрішньо-переміщені особи`),
        SUM(s.`Жінки`),
        -- Книги
        SUM(s.`Всього видано`),
        SUM(s.`Книги`),
        SUM(s.`Брошури`),
        SUM(s.`Періодичні видання`),
        SUM(s.`Електронні видання`),
        SUM(s.`Аудіовізуальні`),
        -- UDC
        SUM(s.`Суспільно-політична література`),
        SUM(s.`Пр-тво, математика, медицина`),
        SUM(s.`Техніка`),
        SUM(s.`С/Г`),
        SUM(s.`Мистецтво і спорт`),
        SUM(s.`Художня література`),
        SUM(s.`Л-ра для дошкільнят, казки`),
        SUM(s.`Мовознавство, літ-тво`),
        SUM(s.`Інші`),
        -- Мови
        SUM(s.`Українською`),
        SUM(s.`Російською`),
        SUM(s.`Англійською`),
        SUM(s.`Угорською`),
        SUM(s.`Румунською`),
        SUM(s.`Словацькою`),
        SUM(s.`Іноземною`),
        SUM(s.`Без мови`),
        SUM(s.`Всього повернуто`)
    FROM 
        temp_all_statistics as s
    WHERE 
        CAST(`Дата` as DATE) BETWEEN date_start AND date_end

    UNION ALL

    SELECT 
        "Всього за весь час",
        "" as `Підрозділ`,
        "" as `Розташування`,
        SUM(s.`За реєстраційною картотекою`),
        SUM(s.`Число відвідувачів`),
        -- Вік
        SUM(s.`До 7 років`),
        SUM(s.`Від 7 до 14 років`),
        SUM(s.`Від 15 до 17 років`),
        SUM(s.`Від 18 до 21 року`),
        SUM(s.`Від 22 до 59 років`),
        SUM(s.`Від 60 років`),
        -- Типи 
        SUM(s.`Студенти`),
        SUM(s.`Люди з особливими потребами`),
        SUM(s.`Безробітні`),
        SUM(s.`Внутрішньо-переміщені особи`),
        SUM(s.`Жінки`),
        -- Книги
        SUM(s.`Всього видано`),
        SUM(s.`Книги`),
        SUM(s.`Брошури`),
        SUM(s.`Періодичні видання`),
        SUM(s.`Електронні видання`),
        SUM(s.`Аудіовізуальні`),
        -- UDC
        SUM(s.`Суспільно-політична література`),
        SUM(s.`Пр-тво, математика, медицина`),
        SUM(s.`Техніка`),
        SUM(s.`С/Г`),
        SUM(s.`Мистецтво і спорт`),
        SUM(s.`Художня література`),
        SUM(s.`Л-ра для дошкільнят, казки`),
        SUM(s.`Мовознавство, літ-тво`),
        SUM(s.`Інші`),
        -- Мови
        SUM(s.`Українською`),
        SUM(s.`Російською`),
        SUM(s.`Англійською`),
        SUM(s.`Угорською`),
        SUM(s.`Румунською`),
        SUM(s.`Словацькою`),
        SUM(s.`Іноземною`),
        SUM(s.`Без мови`),
        SUM(s.`Всього повернуто`)
    FROM 
        temp_all_statistics as s
    WHERE 
        CAST(`Дата` as DATE) <= date_end;


    DROP TEMPORARY TABLE temp_all_statistics;
END; ||
DELIMITER ;


CALL GET_WORK_DIARY(
    << Початкова дата | date >>,
    << Кінцева дата | date >>,
    << Виберіть бібліотеку | branches >>,
    << Підрозділ | LOCA >>
);